import Mathlib

open Nat

-- variant-3969f1f7--h2--h1--h1--h7--h1 vs variant-3969f1f7--h2--h1--h1--h7 have h_sdw36 (20261029T145900Z-t1029e-a-partial.lean)
example : (∀ (u v : ℤ),
  (15 : ℤ) * u ^ (3 : ℕ) - (15 : ℤ) * u = v ^ (3 : ℕ) - (4 : ℤ) * v ^ (2 : ℕ) + (3 : ℤ) * v →
    u = (-1 : ℤ) ∧ v = (0 : ℤ) ∨
      u = (-1 : ℤ) ∧ v = (1 : ℤ) ∨
        u = (-1 : ℤ) ∧ v = (3 : ℤ) ∨
          u = (0 : ℤ) ∧ v = (0 : ℤ) ∨
            u = (0 : ℤ) ∧ v = (1 : ℤ) ∨
              u = (0 : ℤ) ∧ v = (3 : ℤ) ∨
                u = (1 : ℤ) ∧ v = (0 : ℤ) ∨
                  u = (1 : ℤ) ∧ v = (1 : ℤ) ∨
                    u = (1 : ℤ) ∧ v = (3 : ℤ) ∨ u = (2 : ℤ) ∧ v = (6 : ℤ) ∨ u = (8 : ℤ) ∧ v = (21 : ℤ)) ↔ (∀ u v : ℤ, 15 * u ^ 3 - 15 * u = v ^ 3 - 4 * v ^ 2 + 3 * v →
      (u = -1 ∧ v = 0) ∨ (u = -1 ∧ v = 1) ∨ (u = -1 ∧ v = 3) ∨ (u = 0 ∧ v = 0) ∨
        (u = 0 ∧ v = 1) ∨ (u = 0 ∧ v = 3) ∨ (u = 1 ∧ v = 0) ∨ (u = 1 ∧ v = 1) ∨
          (u = 1 ∧ v = 3) ∨ (u = 2 ∧ v = 6) ∨ (u = 8 ∧ v = 21)) := Iff.rfl
