import Mathlib

open Nat

-- variant-3969f1f7--h2--h1--h1--h6--h1 vs variant-3969f1f7--h2--h1--h1--h6 have h_37a1 (20261029T131800Z-t1029e-b-partial.lean)
example : (∀ (x y : ℤ),
  y ^ (2 : ℕ) + y = x ^ (3 : ℕ) - x →
    x = (-1 : ℤ) ∧ y = (0 : ℤ) ∨
      x = (-1 : ℤ) ∧ y = (-1 : ℤ) ∨
        x = (0 : ℤ) ∧ y = (0 : ℤ) ∨
          x = (0 : ℤ) ∧ y = (-1 : ℤ) ∨
            x = (1 : ℤ) ∧ y = (0 : ℤ) ∨
              x = (1 : ℤ) ∧ y = (-1 : ℤ) ∨
                x = (2 : ℤ) ∧ y = (2 : ℤ) ∨
                  x = (2 : ℤ) ∧ y = (-3 : ℤ) ∨ x = (6 : ℤ) ∧ y = (14 : ℤ) ∨ x = (6 : ℤ) ∧ y = (-15 : ℤ)) ↔ (∀ x y : ℤ, y ^ 2 + y = x ^ 3 - x →
      (x = -1 ∧ y = 0) ∨ (x = -1 ∧ y = -1) ∨ (x = 0 ∧ y = 0) ∨ (x = 0 ∧ y = -1) ∨
      (x = 1 ∧ y = 0) ∨ (x = 1 ∧ y = -1) ∨ (x = 2 ∧ y = 2) ∨ (x = 2 ∧ y = -3) ∨
      (x = 6 ∧ y = 14) ∨ (x = 6 ∧ y = -15)) := Iff.rfl
