import Mathlib

open Nat

-- variant-3969f1f7--h2--h1--h4--h2--h3--h2--h1 vs variant-3969f1f7--h2--h1--h4--h2--h3--h2 have h_nagura (20261029T150500Z-t1029e-a-partial.lean)
example : (∀ (x : ℕ), (25 : ℕ) ≤ x → ∃ (p : ℕ), Nat.Prime p ∧ x < p ∧ (5 : ℕ) * p < (6 : ℕ) * x) ↔ (∀ x : ℕ, 25 ≤ x → ∃ p : ℕ, p.Prime ∧ x < p ∧ 5 * p < 6 * x) := Iff.rfl

-- variant-3969f1f7--h2--h1--h4--h2--h3--h2--h2 vs variant-3969f1f7--h2--h1--h4--h2--h3--h2 have h_rest2 (20261029T150500Z-t1029e-a-partial.lean)
example : (∀ (n k m l : ℕ),
  (2 : ℕ) ≤ k →
    (2 : ℕ) * k ≤ n →
      (2 : ℕ) ≤ l →
        (2 : ℕ) * l ≤ m →
          k < l →
            n.choose k = m.choose l →
              (((k = (2 : ℕ) ∧ l = (3 : ℕ) ∨
                      k = (2 : ℕ) ∧ l = (4 : ℕ) ∨
                        k = (2 : ℕ) ∧ l = (5 : ℕ) ∨
                          k = (2 : ℕ) ∧ l = (6 : ℕ) ∨
                            k = (2 : ℕ) ∧ l = (8 : ℕ) ∨
                              k = (3 : ℕ) ∧ l = (4 : ℕ) ∨
                                k = (3 : ℕ) ∧ l = (6 : ℕ) ∨ k = (4 : ℕ) ∧ l = (6 : ℕ) ∨ k = (4 : ℕ) ∧ l = (8 : ℕ)) ∨
                    m + (1 : ℕ) = n ∧ l = k + (1 : ℕ) ∨
                      n ≤ (1000000 : ℕ) ∨
                        n.choose k ≤ (10 : ℕ) ^ (60 : ℕ) ∨
                          m + (1 : ℕ) = n ∧ l = k + (2 : ℕ) ∨ m + (2 : ℕ) = n ∧ l = k + (1 : ℕ)) ∨
                  (500000 : ℕ) ≤ m / (2 : ℕ) ∧
                    m / (2 : ℕ) < (2 : ℕ) * k ∧
                      (1000 : ℕ) * (m / (2 : ℕ) - l) ≤ (735 : ℕ) * (m / (2 : ℕ) - k) ∧
                        m < n ∧ n ≤ (3 : ℕ) * (m / (2 : ℕ))) ∨
                (1000000 : ℕ) < n ∧ (6 : ℕ) * m ≤ (5 : ℕ) * n ∧ n ≤ (6 : ℕ) * k) ↔ (∀ (n k m l : ℕ), 2 ≤ k → 2 * k ≤ n → 2 ≤ l → 2 * l ≤ m → k < l →
      n.choose k = m.choose l →
        (((k = (2 : ℕ) ∧ l = (3 : ℕ) ∨ k = (2 : ℕ) ∧ l = (4 : ℕ) ∨ k = (2 : ℕ) ∧ l = (5 : ℕ) ∨ k = (2 : ℕ) ∧ l = (6 : ℕ) ∨ k = (2 : ℕ) ∧ l = (8 : ℕ) ∨ k = (3 : ℕ) ∧ l = (4 : ℕ) ∨ k = (3 : ℕ) ∧ l = (6 : ℕ) ∨ k = (4 : ℕ) ∧ l = (6 : ℕ) ∨ k = (4 : ℕ) ∧ l = (8 : ℕ)) ∨ m + (1 : ℕ) = n ∧ l = k + (1 : ℕ) ∨ n ≤ (1000000 : ℕ) ∨ n.choose k ≤ (10 : ℕ) ^ (60 : ℕ) ∨ m + (1 : ℕ) = n ∧ l = k + (2 : ℕ) ∨ m + (2 : ℕ) = n ∧ l = k + (1 : ℕ)) ∨ (500000 : ℕ) ≤ m / (2 : ℕ) ∧ m / (2 : ℕ) < (2 : ℕ) * k ∧ (1000 : ℕ) * (m / (2 : ℕ) - l) ≤ (735 : ℕ) * (m / (2 : ℕ) - k) ∧ m < n ∧ n ≤ (3 : ℕ) * (m / (2 : ℕ))) ∨
          (1000000 < n ∧ 6 * m ≤ 5 * n ∧ n ≤ 6 * k)) := Iff.rfl
