import Mathlib

open Nat

-- variant-3969f1f7--h2--h1--h4--h2--h3--h1 vs variant-3969f1f7--h2--h1--h4--h2--h3 have h_yamada (20261029T132500Z-t1029e-a-partial.lean)
example : (∀ (N δ M K L : ℕ),
  (500000 : ℕ) ≤ N →
    δ ≤ (1 : ℕ) →
      M < K →
        (2 : ℕ) * K < N →
          (1000 : ℕ) * M ≤ (735 : ℕ) * K →
            δ < L → L ≤ N → ((2 : ℕ) * N + δ).choose (N - M) ≠ ((2 : ℕ) * N + L).choose (N - K)) ↔ (∀ N δ M K L : ℕ, 500000 ≤ N → δ ≤ 1 → M < K → 2 * K < N → 1000 * M ≤ 735 * K →
      δ < L → L ≤ N → (2 * N + δ).choose (N - M) ≠ (2 * N + L).choose (N - K)) := Iff.rfl

-- variant-3969f1f7--h2--h1--h4--h2--h3--h2 vs variant-3969f1f7--h2--h1--h4--h2--h3 have h_rest (20261029T132500Z-t1029e-a-partial.lean)
example : (∀ (n k m l : ℕ),
  (2 : ℕ) ≤ k →
    (2 : ℕ) * k ≤ n →
      (2 : ℕ) ≤ l →
        (2 : ℕ) * l ≤ m →
          k < l →
            n.choose k = m.choose l →
              ((k = (2 : ℕ) ∧ l = (3 : ℕ) ∨
                    k = (2 : ℕ) ∧ l = (4 : ℕ) ∨
                      k = (2 : ℕ) ∧ l = (5 : ℕ) ∨
                        k = (2 : ℕ) ∧ l = (6 : ℕ) ∨
                          k = (2 : ℕ) ∧ l = (8 : ℕ) ∨
                            k = (3 : ℕ) ∧ l = (4 : ℕ) ∨
                              k = (3 : ℕ) ∧ l = (6 : ℕ) ∨ k = (4 : ℕ) ∧ l = (6 : ℕ) ∨ k = (4 : ℕ) ∧ l = (8 : ℕ)) ∨
                  m + (1 : ℕ) = n ∧ l = k + (1 : ℕ) ∨
                    n ≤ (1000000 : ℕ) ∨
                      n.choose k ≤ (10 : ℕ) ^ (60 : ℕ) ∨
                        m + (1 : ℕ) = n ∧ l = k + (2 : ℕ) ∨ m + (2 : ℕ) = n ∧ l = k + (1 : ℕ)) ∨
                (500000 : ℕ) ≤ m / (2 : ℕ) ∧
                  m / (2 : ℕ) < (2 : ℕ) * k ∧
                    (1000 : ℕ) * (m / (2 : ℕ) - l) ≤ (735 : ℕ) * (m / (2 : ℕ) - k) ∧ m < n ∧ n ≤ (3 : ℕ) * (m / (2 : ℕ))) ↔ (∀ (n k m l : ℕ), 2 ≤ k → 2 * k ≤ n → 2 ≤ l → 2 * l ≤ m → k < l →
      n.choose k = m.choose l →
        ((k = (2 : ℕ) ∧ l = (3 : ℕ) ∨ k = (2 : ℕ) ∧ l = (4 : ℕ) ∨ k = (2 : ℕ) ∧ l = (5 : ℕ) ∨ k = (2 : ℕ) ∧ l = (6 : ℕ) ∨ k = (2 : ℕ) ∧ l = (8 : ℕ) ∨ k = (3 : ℕ) ∧ l = (4 : ℕ) ∨ k = (3 : ℕ) ∧ l = (6 : ℕ) ∨ k = (4 : ℕ) ∧ l = (6 : ℕ) ∨ k = (4 : ℕ) ∧ l = (8 : ℕ)) ∨ m + (1 : ℕ) = n ∧ l = k + (1 : ℕ) ∨ n ≤ (1000000 : ℕ) ∨ n.choose k ≤ (10 : ℕ) ^ (60 : ℕ) ∨ m + (1 : ℕ) = n ∧ l = k + (2 : ℕ) ∨ m + (2 : ℕ) = n ∧ l = k + (1 : ℕ)) ∨
          (500000 ≤ m / 2 ∧ m / 2 < 2 * k ∧ 1000 * (m / 2 - l) ≤ 735 * (m / 2 - k) ∧ m < n ∧
            n ≤ 3 * (m / 2))) := Iff.rfl
