import Mathlib

open Nat

theorem audit_variant_3969f1f7__h2__h1__h4__h1 :
    (∀ (n k m l : ℕ),
  (2 : ℕ) ≤ k →
    (2 : ℕ) * k ≤ n →
      (2 : ℕ) ≤ l →
        (2 : ℕ) * l ≤ m →
          k < l →
            n.choose k = m.choose l →
              n.choose k ≤ (10 : ℕ) ^ (60 : ℕ) →
                (n = (78 : ℕ) ∧ k = (2 : ℕ) ∧ m = (15 : ℕ) ∧ l = (5 : ℕ) ∨
                    n = (78 : ℕ) ∧ k = (2 : ℕ) ∧ m = (14 : ℕ) ∧ l = (6 : ℕ) ∨
                      n = (16 : ℕ) ∧ k = (2 : ℕ) ∧ m = (10 : ℕ) ∧ l = (3 : ℕ) ∨
                        n = (21 : ℕ) ∧ k = (2 : ℕ) ∧ m = (10 : ℕ) ∧ l = (4 : ℕ) ∨
                          n = (56 : ℕ) ∧ k = (2 : ℕ) ∧ m = (22 : ℕ) ∧ l = (3 : ℕ) ∨
                            n = (120 : ℕ) ∧ k = (2 : ℕ) ∧ m = (36 : ℕ) ∧ l = (3 : ℕ) ∨
                              n = (153 : ℕ) ∧ k = (2 : ℕ) ∧ m = (19 : ℕ) ∧ l = (5 : ℕ) ∨
                                n = (221 : ℕ) ∧ k = (2 : ℕ) ∧ m = (17 : ℕ) ∧ l = (8 : ℕ)) ∨
                  ∃ (i : ℕ),
                    (1 : ℕ) ≤ i ∧
                      n = Nat.fib ((2 : ℕ) * i + (2 : ℕ)) * Nat.fib ((2 : ℕ) * i + (3 : ℕ)) ∧
                        k = Nat.fib ((2 : ℕ) * i) * Nat.fib ((2 : ℕ) * i + (3 : ℕ)) ∧ m + (1 : ℕ) = n ∧ l = k + (1 : ℕ))
    =
    (∀ n k m l : ℕ, 2 ≤ k → 2 * k ≤ n → 2 ≤ l → 2 * l ≤ m → k < l → choose n k = choose m l →
          choose n k ≤ 10 ^ 60 →
          ((n = 78 ∧ k = 2 ∧ m = 15 ∧ l = 5) ∨ (n = 78 ∧ k = 2 ∧ m = 14 ∧ l = 6) ∨
           (n = 16 ∧ k = 2 ∧ m = 10 ∧ l = 3) ∨ (n = 21 ∧ k = 2 ∧ m = 10 ∧ l = 4) ∨
           (n = 56 ∧ k = 2 ∧ m = 22 ∧ l = 3) ∨ (n = 120 ∧ k = 2 ∧ m = 36 ∧ l = 3) ∨
           (n = 153 ∧ k = 2 ∧ m = 19 ∧ l = 5) ∨ (n = 221 ∧ k = 2 ∧ m = 17 ∧ l = 8)) ∨
          ∃ i : ℕ, 1 ≤ i ∧ n = fib (2 * i + 2) * fib (2 * i + 3) ∧ k = fib (2 * i) * fib (2 * i + 3) ∧
            m + 1 = n ∧ l = k + 1) := rfl
